app/controllers/static_pages_controller.rb

    def show
        @users = User.all
---
SELECT "users".* FROM "users"