app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "last_name" = $2, "email" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", nil], ["last_name", nil], ["email", nil], ["updated_at", "2018-11-05 20:37:53.351345"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)